sugarcrm-connector-test/src/test/resources/artifacts/ESB/config/soapRequests/sugarcrm/getDocumentRevision.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sug="wso2.connector.sugarcrm.getdocumentrevision">
   <soapenv:Header/>
   <soapenv:Body>
   	<sug:sugarCRMApiUrl>https://ypbvhe6054.trial.sugarcrm.com/soap.php</sug:sugarCRMApiUrl>    	
   	<sug:session>be0mc58ko3mcjhcfbj3jqasi16</sug:session>
   	<sug:id>1</sug:id>
   </soapenv:Body>
</soapenv:Envelope>